export const words = {
  greetings: [
    'сәлем',
    'сәлеметсіз бе',
    'рақмет',
    'жақсы',
    'қалайсыз',
    'әлем',
  ],
  school: [
    'кітап',
    'мектеп',
    'балабақша',
    'сынып',
    'оқушы',
    'мұғалім',
    'тақырып',
    'сабақ',
  ],
  city: [
    'қала',
    'аудан',
    'көше',
    'үй',
    'жол',
    'транспорт',
    'автобус',
    'бақша',
    'жұмыс',
    'кеңсе',
  ],
  food: [
    'нан',
    'тұз',
    'қант',
    'сүт',
    'айран',
    'қымыз',
    'май',
    'ет',
    'тәтті',
    'ас',
  ],
  nature: [
    'дала',
    'жер',
    'су',
    'күн',
    'ай',
    'бұлт',
    'жаңбыр',
    'орман',
    'ағаш',
    'гүл',
  ],
  animals: [
    'мысық',
    'ит',
    'қой',
    'жылқы',
    'балық',
    'құс',
    'қасқыр',
    'үйрек',
    'құрт',
    'бақа',
  ],
};

export const allWords = Object.values(words).flat();

export const getRandomWord = () => {
  const flatWords = Object.values(words).flat();
  return flatWords[Math.floor(Math.random() * flatWords.length)];
};